using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Domashka
{
    internal class T_6_2_while
    {
        public void Go()
        {
            int count = 0;
            int sum = 0;
            int i = 1;
            Console.WriteLine("Введите, сколько всего чисел будет: ");
            int a = int.Parse(Console.ReadLine());
        }
    }
}

// Дана не пустая последовательность неотрицательных целых чисел, оканчивающаяся отрицательныи числом.
// Найти среднее арифм. всех чисел последовательности (без учета отрицательного числа)
